{"config": {"name": "model_2", "layers": [{"config": {"sparse": false, "name": "input_2", "batch_input_shape": [null, 450, 450, 3], "dtype": "float32"}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "linear", "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "filters": 16, "batch_input_shape": [null, 450, 450, 3], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv2d_5", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dtype": "float32"}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "name": "batch_normalization_5", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null}, "name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"config": {"name": "average_pooling2d_4", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "name": "average_pooling2d_4", "class_name": "AveragePooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "linear", "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv2d_6", "use_bias": true, "trainable": true}, "name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_4", 0, 0, {}]]]}, {"config": {"center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "name": "batch_normalization_6", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null}, "name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"config": {"name": "average_pooling2d_5", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "name": "average_pooling2d_5", "class_name": "AveragePooling2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "linear", "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "filters": 48, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"value": 0}, "class_name": "Constant"}, "bias_regularizer": null, "name": "conv2d_7", "use_bias": true, "trainable": true}, "name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}]]]}, {"config": {"center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "name": "batch_normalization_7", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null}, "name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"name": "average_pooling2d_6", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "name": "average_pooling2d_6", "class_name": "AveragePooling2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "linear", "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [5, 5], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"value": 0}, "class_name": "Constant"}, "bias_regularizer": null, "name": "conv2d_8", "use_bias": true, "trainable": true}, "name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_6", 0, 0, {}]]]}, {"config": {"center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "name": "batch_normalization_8", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null}, "name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_2"}, "name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 128, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_4"}, "name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"config": {"seed": null, "name": "dropout_2", "noise_shape": null, "rate": 0.3, "trainable": true}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 32, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_5"}, "name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 2, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_6"}, "name": "dense_6", "class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_6", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.2"}