{"keras_version": "2.2.2", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 450, 450, 3], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"use_bias": true, "filters": 32, "padding": "same", "batch_input_shape": [null, 450, 450, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_1", "kernel_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"axis": -1, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_1", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "same", "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"use_bias": true, "filters": 48, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "padding": "same", "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "name": "conv2d_2", "activation": "linear"}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"axis": -1, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_2", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "same", "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"use_bias": true, "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {"value": 0}, "class_name": "Constant"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "padding": "same", "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "name": "conv2d_3", "activation": "linear"}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"axis": -1, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_3", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "same", "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"config": {"use_bias": true, "filters": 128, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {"value": 0}, "class_name": "Constant"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "name": "conv2d_4", "activation": "linear"}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"config": {"axis": -1, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_4", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "units": 128, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "name": "dense_1", "bias_constraint": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "units": 2, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "name": "dense_2", "bias_constraint": null}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}